idodeclare/illumos-gate/usr/src/man/man5/nodename.5
'\" te
.\" Copyright 2015 Nexenta Systems, Inc.  All rights reserved.
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2025 Chris Fraire <cfraire@me.com>
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NODENAME 5 "Jan 19, 2025"
.SH NAME
nodename \- local source for system name
.SH SYNOPSIS
.LP
.nf
\fB/etc/nodename\fR
.fi

.SH DESCRIPTION
.LP
When a machine is standalone or its IP address is configured locally, the
\fB/etc/nodename\fR file contains the system name. By convention, the system
name is the same as the hostname associated with the IP address of the primary
network interface, for example, \fBhostname.hme0\fR.
.LP
If the machine's network configuration is delivered by the RPC bootparams
protocol, the \fB/etc/nodename\fR file is not used, as the system name is
delivered by the remote service.
.LP
When a non-global zone's IP address is configured locally, and if the zone
starts
.BR svc:/system/identity:node ,
then
.BR zonecfg (8)
.B zonename
is the system name unless the
.B /etc/nodename
file exists to override.
.LP
If a machine's or non-global zone's network configuration is delivered by the
DHCP protocol, the
.B /etc/nodename
file or
.B zonename
is used only if the DHCP server does not provide a value for the Hostname
option (DHCP standard option code 12).
.LP
A system name configured in \fB/etc/nodename\fR should be unique within the
system's name service domain in order to ensure that any network services
provided by the system will operate correctly.
.LP
Given a system name value, regardless of source, the \fBuname\fR utility
invoked with the \fB-S\fR option is used to set the system name of the running
system.
.SH EXAMPLES
.LP
\fBExample 1 \fRSyntax
.sp
.LP
The syntax for
.B /etc/nodename
consists of a single line containing the system's name. For example, for a
system named "myhost":

.sp
.in +2
.nf
myhost
.fi
.in -2

.SH SEE ALSO
.LP
.BR uname (1),
.BR attributes (7),
.BR named (8),
.BR ypbind (8),
.BR zonecfg (8)
.SH NOTES
.LP
The
.B /etc/nodename
file is modified by system installation and de-installation scripts.
